[Killed] StringLiteral
main/components/Courses/CoursesTable.js:47:23
         },
         {
             Header: 'School',
-            accessor: 'school',
+            accessor: "",
         },
         {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-school"]

<body>
  <div>
    <div>
      Total Courses: 
      3
    </div>
