[Killed] BlockStatement
src/main/pages/CoursesShowPage.js:8:42
 import CoursesTable from 'main/components/Courses/CoursesTable';
 import { useCurrentUser} from 'main/utils/currentUser';
 
-export default function CourseShowPage() {
-
-  let { id } = useParams();
-  const { data: currentUser } = useCurrentUser();
-  
-  const { data: courses, error: _error, status: _status } =
-    useBackend(
-      // Stryker disable next-line all : don't test internal caching of React Query
-      [`/api/courses?id=${id}`],
-      // Stryker disable next-line all : GET is the default
-      { method: "GET", url: "/api/courses/get", params: { id }},
-      // Stryker disable next-line all : GET is the default
-      []
-    );
-
-
-    return (
-      <BasicLayout>
-        <div className="pt-2">
-          <h1>Course {id} Info</h1>
-          <CoursesTable courses={[courses]} currentUser={currentUser} />
-        </div>
-      </BasicLayout>
-    )
-}
+export default function CourseShowPage() {}
 
killedBy: CoursesShowPage tests when the backend doesn't return data renders header but table is not present
statusReason: Error: CourseShowPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] ArrayDeclaration
src/main/pages/CoursesShowPage.js:28:34
       <BasicLayout>
         <div className="pt-2">
           <h1>Course {id} Info</h1>
-          <CoursesTable courses={[courses]} currentUser={currentUser} />
+          <CoursesTable courses={[]} currentUser={currentUser} />
         </div>
       </BasicLayout>
killedBy: CoursesShowPage tests tests where backend is working normally renders with data
statusReason: TestingLibraryElementError: Unable to find an element with the text: CS 156. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
