[Killed] StringLiteral
main/components/Students/StudentsTable.js:20:23
         },
         {
             Header: 'fName',
-            accessor: 'fName',
+            accessor: "",
         },
         {
killedBy: StudentsTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Fred
Received:
