[Killed] OptionalChaining
main/components/School/SchoolForm.js:43:30
                         />
                         </OverlayTrigger>
                         <Form.Control.Feedback type="invalid">
-                            {errors.abbrev?.type === 'required' && 'Abbreviation is required. '}
+                            {errors.abbrev.type === 'required' && 'Abbreviation is required. '}
                             {errors.abbrev?.type === 'pattern' && 'Abbreviation must be lowercase letters (_ and . allowed), e.g. ucsb'}
                         </Form.Control.Feedback>
killedBy: SchoolForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'type')
