[Killed] LogicalOperator
src/main/pages/CoursesEditPage.js:79:11
       <div className="pt-2">
         <h1>Edit Course</h1>
         {
-          githubStatus && githubStatus.githubAppInstalled === false &&
-          <GHATips app={githubStatus.name} org={course.githubOrg}></GHATips>
+          githubStatus && githubStatus.githubAppInstalled === false || <GHATips app={githubStatus.name} org={course.githubOrg}></GHATips>
         }
         {
killedBy: CoursesEditPage tests when the backend doesn't return data renders header but table is not present
statusReason: TypeError: Cannot read properties of undefined (reading 'name')
