[Killed] ObjectLiteral
main/components/Courses/GitHubAppTips.js:5:22
 
 export default function GitHubAppTips({ app, org }) {
     return (<div data-testid="CourseEdit-githubAppTips">
-        <Card style={{ marginBottom: 20, marginTop: 20 }} data-testid="CourseEdit-GHAT-Card">
+        <Card style={{}} data-testid="CourseEdit-GHAT-Card">
             <Card.Body>
                 <Card.Title>Warning: Your organization does not seem to have our GitHub App installed</Card.Title>
killedBy: CoursesEditPage tests tests where backend is working normally Yes Github App tips!
statusReason: Error: expect(element).toHaveStyle()

- Expected

- margin-bottom: 20px;
