[Survived] StringLiteral
main/components/Courses/GitHubAppTips.js:4:17
 import { Card } from 'react-bootstrap';
 
 export default function GitHubAppTips({ githubStatus, org }) {
-    console.log("org=", org, "githubStatus=", githubStatus);
+    console.log("", org, "githubStatus=", githubStatus);
 
     if (githubStatus?.exceptionThrown)

[Killed] ConditionalExpression
main/components/Courses/GitHubAppTips.js:6:9
 export default function GitHubAppTips({ githubStatus, org }) {
     console.log("org=", org, "githubStatus=", githubStatus);
 
-    if (githubStatus?.exceptionThrown)
+    if (false)
         return (
             <div data-testid="CourseEdit-githubAppTips">
killedBy: CoursesEditPage tests tests where backend is working normally Error Github App tips! (exceptionThrown)
statusReason: TestingLibraryElementError: Unable to find an element with the text: OOOOOOPS THIS IS AN ERROR. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ConditionalExpression
main/components/Courses/GitHubAppTips.js:6:9
 export default function GitHubAppTips({ githubStatus, org }) {
     console.log("org=", org, "githubStatus=", githubStatus);
 
-    if (githubStatus?.exceptionThrown)
+    if (true)
         return (
             <div data-testid="CourseEdit-githubAppTips">
killedBy: CoursesEditPage tests tests where backend is working normally Yes Github App tips!
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CourseEdit-GHAT-Card"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] LogicalOperator
main/components/Courses/GitHubAppTips.js:25:9
             </div>
         );
 
-    if (githubStatus && !(githubStatus.name))
+    if (githubStatus || !githubStatus.name)
         return (<div data-testid="CourseEdit-githubAppTips">
             <Card style={{ marginBottom: 20, marginTop: 20 }} data-testid="CourseEdit-GHAT-Card-Error">
killedBy: CoursesEditPage tests tests where backend is working normally Yes Github App tips!
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CourseEdit-GHAT-Card"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
