[Timeout] BlockStatement
main/components/Courses/CoursesTable.js:12:36
 
     const navigate = useNavigate();
 
-    const joinCallback = (cell) => {
-        navigate(`/courses/join/${cell.row.values.id}`);
-    };
+    const joinCallback = (cell) => {};
 
     const staffCallback = (cell) => {

[Timeout] BlockStatement
main/components/Courses/CoursesTable.js:16:37
         navigate(`/courses/join/${cell.row.values.id}`);
     };
 
-    const staffCallback = (cell) => {
-        navigate(`/courses/${cell.row.values.id}/staff`);
-    };
+    const staffCallback = (cell) => {};
 
     const editCallback = (cell) => {

[Timeout] StringLiteral
main/components/Courses/CoursesTable.js:17:18
     };
 
     const staffCallback = (cell) => {
-        navigate(`/courses/${cell.row.values.id}/staff`);
+        navigate(``);
     };
 

[Timeout] ArrowFunction
main/components/Courses/CoursesTable.js:40:20
          {
              Header: 'id',
              accessor: 'id',
-             Cell: ({ value }) => <a data-testid={`linkToCoursesPage-${value}`} href={`/courses/${value}`}>{value}</a>,
+             Cell: () => undefined,
          },
          {

[Killed] ObjectLiteral
main/components/Courses/CoursesTable.js:46:10
              Header: 'Name',
              accessor: 'name',
          },
-         {
-             Header: 'School',
-             accessor: 'school',
-         },
+         {},
          {
              Header: 'Term',
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Courses/CoursesTable.js:51:22
              accessor: 'school',
          },
          {
-             Header: 'Term',
+             Header: "",
              accessor: 'term',
          },
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Term. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div>
      Total Courses: 
      3
    </div>

[Killed] StringLiteral
main/components/Courses/CoursesTable.js:59:22
              accessor: 'startDate',
          },
          {
-             Header: 'EndDate',
+             Header: "",
              accessor: 'endDate',
          },
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: EndDate. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div>
      Total Courses: 
      3
    </div>

[Killed] StringLiteral
main/components/Courses/CoursesTable.js:60:24
          },
          {
              Header: 'EndDate',
-             accessor: 'endDate',
+             accessor: "",
          },
          {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-endDate"]

<body>
  <div>
    <div>
      Total Courses: 
      3
    </div>

[Killed] LogicalOperator
main/components/Courses/CoursesTable.js:68:9
          },
     ];
 
-    if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {
+    if (hasRole(currentUser, "ROLE_ADMIN") && hasRole(currentUser, "ROLE_INSTRUCTOR")) {
         columns.push({
             Header: 'GitHub App Installed',
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element with the text: GitHub App Installed. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div>
      Total Courses: 
      3
    </div>

[Killed] ObjectLiteral
main/components/Courses/CoursesTable.js:69:22
     ];
 
     if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {
-        columns.push({
-            Header: 'GitHub App Installed',
-            accessor: 'githubAppInstalled',
-        })
+        columns.push({})
         columns.push(ButtonColumn("Staff", "primary", staffCallback, "CoursesTable"));
         columns.push(ButtonColumn("Edit", "primary", editCallback, "CoursesTable"));
killedBy: UserTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Courses/CoursesTable.js:73:70
             Header: 'GitHub App Installed',
             accessor: 'githubAppInstalled',
         })
-        columns.push(ButtonColumn("Staff", "primary", staffCallback, "CoursesTable"));
+        columns.push(ButtonColumn("Staff", "primary", staffCallback, ""));
         columns.push(ButtonColumn("Edit", "primary", editCallback, "CoursesTable"));
         columns.push(ButtonColumn("Delete", "danger", deleteCallback, "CoursesTable"));
killedBy: UserTable tests Has the expected colum headers and content for instructorUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-Staff-button"]

<body>
  <div>
    <div>
      Total Courses: 
      3
    </div>

[Killed] StringLiteral
main/components/Courses/CoursesTable.js:78:31
         columns.push(ButtonColumn("Delete", "danger", deleteCallback, "CoursesTable"));
     }
 
-    columns.push(ButtonColumn("Join", "primary", joinCallback, "CoursesTable"));
+    columns.push(ButtonColumn("", "primary", joinCallback, "CoursesTable"));
 
     const coursesMapped = courses.map((course) => {
killedBy: CourseIndexPage tests Renders with Create Button for admin user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Courses/CoursesTable.js:78:64
         columns.push(ButtonColumn("Delete", "danger", deleteCallback, "CoursesTable"));
     }
 
-    columns.push(ButtonColumn("Join", "primary", joinCallback, "CoursesTable"));
+    columns.push(ButtonColumn("Join", "primary", joinCallback, ""));
 
     const coursesMapped = courses.map((course) => {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] BlockStatement
main/components/Courses/CoursesTable.js:80:51
 
     columns.push(ButtonColumn("Join", "primary", joinCallback, "CoursesTable"));
 
-    const coursesMapped = courses.map((course) => {
-        return {
-            ...course,
-            githubAppInstalled: course.githubAppInstallationId ? "✔️" : "⚠️",
-        };
-    })
+    const coursesMapped = courses.map((course) => {})
 
     return (
killedBy: CourseIndexPage tests renders three courses correctly for admin
statusReason: TypeError: Cannot read properties of undefined (reading 'subRows')

[Killed] StringLiteral
main/components/Courses/CoursesTable.js:83:66
     const coursesMapped = courses.map((course) => {
         return {
             ...course,
-            githubAppInstalled: course.githubAppInstallationId ? "✔️" : "⚠️",
+            githubAppInstalled: course.githubAppInstallationId ? "" : "⚠️",
         };
     })
killedBy: UserTable tests Has the expected colum headers and content for instructorUser
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  ✔️
Received:

[Timeout] StringLiteral
main/components/Courses/CoursesTable.js:90:70
     return (
         <>
             <div>Total Courses: {coursesMapped.length}</div>
-            <OurTable data={coursesMapped} columns={columns} testid={"CoursesTable"} />
+            <OurTable data={coursesMapped} columns={columns} testid={""} />
             <p>If you see a ⚠️ next to the github org label, it means you need to install the github app in your course organization. Click the edit button to do that.</p>
         </>
