[Killed] StringLiteral
src/main/pages/CourseJoinPage.js:19:22
             [`/api/courses/join?id=${id}`],
             {  // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
                 method: "GET",
-                url: `/api/courses/join`,
+                url: ``,
                 params: {
                     id
killedBy: CourseJoinPage tests when the backend doesn't return data Load data with backend info
statusReason: Error: Unable to find an element with the text: Join. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
src/main/pages/CourseJoinPage.js:26:36
             }
         );
 
-    const objectToAxiosPutParams = (_course) => ({
-        url: "/api/courses/join",
-        method: "POST",
-        params: {
-            courseId: id
-        },
-    });
+    const objectToAxiosPutParams = () => undefined;
 
     const onSuccess = (_course) => {
killedBy: CourseJoinPage tests when the backend doesn't return data Do the job when click join
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
src/main/pages/CourseJoinPage.js:28:17
 
     const objectToAxiosPutParams = (_course) => ({
         url: "/api/courses/join",
-        method: "POST",
+        method: "",
         params: {
             courseId: id
killedBy: CourseJoinPage tests when the backend doesn't return data Do the job when click join
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
src/main/pages/CourseJoinPage.js:34:36
         },
     });
 
-    const onSuccess = (_course) => {
-        toast(`Joined successfully`);
-    }
+    const onSuccess = (_course) => {}
 
     const mutation = useBackendMutation(
killedBy: CourseJoinPage tests when the backend doesn't return data Do the job when click join
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
src/main/pages/CourseJoinPage.js:35:15
     });
 
     const onSuccess = (_course) => {
-        toast(`Joined successfully`);
+        toast(``);
     }
 
killedBy: CourseJoinPage tests when the backend doesn't return data Do the job when click join
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Joined successfully"
Received: ""

Number of calls: 1

[Killed] BlockStatement
src/main/pages/CourseJoinPage.js:47:39
 
     const { isSuccess } = mutation
 
-    const onSubmit = async (_data) => {
-        mutation.mutate({});
-    }
+    const onSubmit = async (_data) => {}
 
     if (isSuccess && !storybook) {
killedBy: CourseJoinPage tests when the backend doesn't return data Do the job when click join
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BooleanLiteral
src/main/pages/CourseJoinPage.js:59:18
         <BasicLayout>
             <div className="pt-2">
                 <h1>Join Course</h1>
-                {!courseInfo && (<h3>Loading</h3>)}
+                {courseInfo && (<h3>Loading</h3>)}
                 {
                     courseInfo && (<>
killedBy: CourseJoinPage tests Loading before backend returns Load data with backend info
statusReason: Error: Unable to find an element with the text: Loading. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ConditionalExpression
src/main/pages/CourseJoinPage.js:59:18
         <BasicLayout>
             <div className="pt-2">
                 <h1>Join Course</h1>
-                {!courseInfo && (<h3>Loading</h3>)}
+                {true}
                 {
                     courseInfo && (<>
killedBy: CourseJoinPage tests Loading before backend returns Load data with backend info
statusReason: Error: Unable to find an element with the text: Loading. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ConditionalExpression
src/main/pages/CourseJoinPage.js:61:21
                 <h1>Join Course</h1>
                 {!courseInfo && (<h3>Loading</h3>)}
                 {
-                    courseInfo && (<>
-                        <h3>Are you sure you want to join this course?</h3>
-                        <p data-testid="CourseJoin-school">Course school: {courseInfo.school}</p>
-                        <p>Course term: {courseInfo.term}</p>
-                        <p>Course name: {courseInfo.name}</p>
-                        <Button variant="primary" onClick={onSubmit} style={{ marginRight: 20 }}>Join</Button>
-                    </>)
+                    false
                 }
             </div>
killedBy: CourseJoinPage tests when the backend doesn't return data Load data with backend info
statusReason: Error: Unable to find an element with the text: Join. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] LogicalOperator
src/main/pages/CourseJoinPage.js:61:21
                 <h1>Join Course</h1>
                 {!courseInfo && (<h3>Loading</h3>)}
                 {
-                    courseInfo && (<>
-                        <h3>Are you sure you want to join this course?</h3>
-                        <p data-testid="CourseJoin-school">Course school: {courseInfo.school}</p>
-                        <p>Course term: {courseInfo.term}</p>
-                        <p>Course name: {courseInfo.name}</p>
-                        <Button variant="primary" onClick={onSubmit} style={{ marginRight: 20 }}>Join</Button>
-                    </>)
+                    courseInfo || <>
+                        <h3>Are you sure you want to join this course?</h3>
+                        <p data-testid="CourseJoin-school">Course school: {courseInfo.school}</p>
+                        <p>Course term: {courseInfo.term}</p>
+                        <p>Course name: {courseInfo.name}</p>
+                        <Button variant="primary" onClick={onSubmit} style={{
+    marginRight: 20
+  }}>Join</Button>
+                    </>
                 }
             </div>
killedBy: CourseJoinPage tests Loading before backend returns Load data with backend info
statusReason: TypeError: Cannot read properties of undefined (reading 'school')

[Killed] ObjectLiteral
src/main/pages/CourseJoinPage.js:66:77
                         <p data-testid="CourseJoin-school">Course school: {courseInfo.school}</p>
                         <p>Course term: {courseInfo.term}</p>
                         <p>Course name: {courseInfo.name}</p>
-                        <Button variant="primary" onClick={onSubmit} style={{ marginRight: 20 }}>Join</Button>
+                        <Button variant="primary" onClick={onSubmit} style={{}}>Join</Button>
                     </>)
                 }
killedBy: CourseJoinPage tests when the backend doesn't return data Do the job when click join
statusReason: Error: expect(element).toHaveStyle()

- Expected

- margin-right: 20px;
