[Killed] ObjectLiteral
src/main/pages/CoursesEditPage.js:16:7
     useBackend(
       // Stryker disable next-line all : don't test internal caching of React Query
       [`/api/courses?id=${id}`],
-      {  // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
-        method: "GET",
-        url: `/api/courses/get`,
-        params: {
-          id
-        }
-      }
+      {}
     );
 
killedBy: CoursesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="CoursesForm-name"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ObjectLiteral
src/main/pages/CoursesEditPage.js:29:7
     useBackend(
       // Stryker disable next-line all : don't test internal caching of React Query
       [`/api/courses/github?id=${id}`],
-      {  // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
-        method: "GET",
-        url: `/api/courses/github`,
-        params: {
-          id
-        }
-      }
+      {}
     );
 
killedBy: CoursesEditPage tests tests where backend is working normally Yes Github App tips!
statusReason: Error: Unable to find an element by: [data-testid="CourseEdit-githubAppTips"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
src/main/pages/CoursesEditPage.js:41:13
 
   const objectToAxiosPutParams = (course) => ({
     url: "/api/courses/update",
-    method: "PUT",
+    method: "",
     params: {
       id: course.id,
killedBy: CoursesEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
src/main/pages/CoursesEditPage.js:54:11
   });
 
   const onSuccess = (course) => {
-    toast(`Course Updated - id: ${course.id} name: ${course.name}`);
+    toast(``);
   }
 
killedBy: CoursesEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Course Updated - id: 17 name: CS 148"
Received: ""

Number of calls: 1

[Killed] ConditionalExpression
src/main/pages/CoursesEditPage.js:79:27
       <div className="pt-2">
         <h1>Edit Course</h1>
         {
-          githubStatus && githubStatus.githubAppInstalled === false &&
+          githubStatus && true &&
           <GHATips githubStatus={githubStatus} org={course.githubOrg}></GHATips>
         }
killedBy: CoursesEditPage tests tests where backend is working normally No Github App tips!
statusReason: Error: expect(element).not.toBeInTheDocument()

[Killed] LogicalOperator
src/main/pages/CoursesEditPage.js:79:11
       <div className="pt-2">
         <h1>Edit Course</h1>
         {
-          githubStatus && githubStatus.githubAppInstalled === false &&
+          githubStatus || githubStatus.githubAppInstalled === false &&
           <GHATips githubStatus={githubStatus} org={course.githubOrg}></GHATips>
         }
killedBy: CoursesEditPage tests when the backend doesn't return data renders header but table is not present
statusReason: TypeError: Cannot read properties of undefined (reading 'githubAppInstalled')

[Killed] ConditionalExpression
src/main/pages/CoursesEditPage.js:83:11
           <GHATips githubStatus={githubStatus} org={course.githubOrg}></GHATips>
         }
         {
-          course && <CoursesForm initialContents={course} submitAction={onSubmit} buttonLabel="Update" />
+          true
         }
       </div>
killedBy: CoursesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="CoursesForm-name"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
